user_startup_text = '''Здравствуйте! Я — Орешек, ваш помощник, который поможет вам начать разговор и сделает его более увлекательным. 🌰

Выберите режим работы "Случайные вопросы" 🎲, чтобы получить случайный вопрос, который поможет вам начать беседу.

Чтобы начать общение, добавьте бота в вашу группу, в которой вы собираетесь общаться. 💬

Если у вас возникли вопросы, подробную инструкцию можно найти, нажав на кнопку "Подробная инструкция" 📜.

Если хотите узнать всю основную информацию о боте, нажмите на кнопку "Информация" ℹ️.'''

user_startup_text_no_sub = """Здравствуйте, для начало подишись на канал

Бот полностью бесплатный но для того чтобы пользоваться ботом вам нужно подписаться на канал
"""

help_text = '''Чтобы начать использовать бота, выполните следующие шаги:
    1.Создайте группу 👥
    2.Добавьте туда своего друга 👦
    3.Затем добавьте бота 🤖
    4.Сделайте его администратором и предоставьте доступ к чтению сообщений 🛠️
    5.После этого нажмите команду "Запустить" 🚀
'''

about_text = '''Орешек — это уникальный бот, созданный специально для того, чтобы сделать ваше онлайн-общение более интересным и увлекательным. 🌐

В жизни бывают моменты, когда хочется начать знакомство с кем-то новым с самого начала, узнать его поближе и поделиться своими мыслями и чувствами. Наш бот как раз для таких случаев! 🗣️

С помощью Орешка вы сможете не только ответить на забавные и необычные вопросы, которые разбудят ваше любопытство , но и погрузиться в более глубокие и философские обсуждения о смысле жизни, мечтах и целях 🤔.

Мы надеемся, что общение с нашим ботом станет для вас интересным и познавательным опытом!

Контактные данные:'''

start_command_text_1 = "Привет. Я бот для обещения.Нажмите кнопку ниже, чтобы добавить бота в группу как администратора:"